mydata/pages/portfolio/index.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>---</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="---"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-05-24 13:12:55 EDT"/>
<meta name="author" content="Neil Smithline"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">---</h1>


layout:         page
title:          "Portfolio"
date:           2012-05-21 15:29
comments:       true
sharing:        true
footer:         true
published:      false
---






<script src="http://ajax.googleapis.com/ajax/libs/jquery/1.7.2/jquery.min.js" type="text/javascript"></script>   <script src="http://ajax.googleapis.com/ajax/libs/jquery/1.7.2/jquery.min.js" type="text/javascript"></script>    <script src="http://code.jquery.com/ui/1.8.20/jquery-ui.min.js" type="text/javascript"></script>    <script src="http://jquery-ui.googlecode.com/svn/tags/latest/external/jquery.bgiframe-2.1.2.js" type="text/javascript"></script>    <script src="http://jquery-ui.googlecode.com/svn/tags/latest/ui/minified/i18n/jquery-ui-i18n.min.js" type="text/javascript"></script>

<div id="myaccordion">

<h3><a href='#'>Overview</a></h3><div class="jquery-first-tab jquery-tab accordion-first-tab accordion-tab">
<p>
This page contains a sampling of some of the open-source projects I have contributed to or written from scratch since February 2011.
</p>


</div> <br/><br/><!-- jquery-tab --><h3><a href='#'>Choice Of Projects</a></h3><div class="jquery-tab accordion-tab"> 
<p>
There were two primary reasons that led me to choose to work on these projects.
</p>
<p>
The first reason is my desire to be more efficient. This can be seen throughout my virtual and non-virtual lives as well as my personal and professional life. 
</p>
<p>
A second motivation that permeates my life is "curiosity" or, perhaps better, "an ongoing quest for knowledge". To facilitate this, I chose projects that would force me to learn a new language, a new platform, a new protocol, etc&hellip;
</p>
<p>
For example, the page you are reading is:
</p><ul>
<li>A page in a Jekyll blog
</li>
<li>Part of a blog that is hosted on Github
</li>
<li>Was written using Org Mode
</li>
<li>Uses JQuery via custom-written Org Mode macros
</li>
</ul>


<p>
Despite this array of technologies, all of which I've learned in the past year or so, this system has virtually no overhead. This way I can spend my time writing content and not monkeying around with the technologies. 
</p>
<p>
Not every project I undertook was successful. For example, I dedicated a large quantity of my time working on my blog technology only to end up switching blogging technologies. If you're interested, I blogged about these <a href="{{ root<sub>url</sub> }}blog/categories/blogging-tech" title="Blog postings about my blogging technology">ups-and-downs</a>.
</p>


</div> <br/><br/><!-- jquery-tab --><h3><a href='#'>Technologies Used</a></h3><div class="jquery-tab accordion-tab">

<p>
This is a list of technologies that I have used, some to a greater than othersextent, during the course of working on these projects. Technologies marked with an asterisk (*) are technologies that I had no exposure to prior to February 2011.
</p>
<ul>
<li><a href="http://bit.ly/KfsaP3">JavaScript</a>
</li>
<li><a href="http://bit.ly/KfsgpG">Elisp</a> including <a href="http://bit.ly/KfswFn">GNU Emacs</a>' <a href="http://bit.ly/KfstJB">Common Lisp</a> extensions and <a href="http://bit.ly/KqF65A">Org Mode</a>*
</li>
<li><a href="http://bit.ly/KfsCg4">Python</a>*
</li>
<li><a href="http://bit.ly/KfsCg4">Ruby</a>*
</li>
<li><a href="http://en.wikipedia.org/wiki/Lua_(programming_language)">Lua</a>*
</li>
<li><a href="http://bit.ly/II0Tpm">Bash</a>
</li>
<li><a href="http://bit.ly/KfuNQQ">Ubuntu</a> (and <a href="http://bit.ly/wC6y67">Linux</a> in general)
</li>
<li><a href="http://bit.ly/Kfv0n2">Mac OS X</a>
</li>
<li><a href="http://bit.ly/Kfv4mR">IMAP</a>*
</li>
<li>Google's <a href="http://bit.ly/IQMgvI">IMAP extensions</a>*
</li>
<li><a href="http://bit.ly/KqEPQf">Firefox</a>*
</li>
<li><a href="http://bit.ly/KqFSzD">JQuery</a>*
</li>
<li><a href="http://bit.ly/KqIGNb">Github</a>*
</li>
<li><a href="http://bit.ly/JetyoE">Jekyll</a>*
</li>
</ul>





</div> <br/><br/><!-- jquery-tab --><h3><a href='#'>My Projects</a></h3><div class="jquery-tab accordion-tab">



<div id="outline-container-1" class="outline-4">
<h4 id="sec-1">Firefox Add-On</h4>
<div class="outline-text-4" id="text-1">

<p><a href="{{ root<sub>url</sub> }}portfolio/firefox-add-on" title="More about my Firefox add-on">Read More</a>
</p>

</div>

</div>

<div id="outline-container-2" class="outline-4">
<h4 id="sec-2">UserScripts</h4>
<div class="outline-text-4" id="text-2">

<p> [[./userscripts][Read More]
</p>

</div>

</div>

<div id="outline-container-3" class="outline-4">
<h4 id="sec-3">IMAPFilter</h4>
<div class="outline-text-4" id="text-3">


<p>
This section is still under construction.
</p>
</div>

</div>

<div id="outline-container-4" class="outline-4">
<h4 id="sec-4">Gmail2Gcal</h4>
<div class="outline-text-4" id="text-4">

<p> [[./gmail2gcal][Read More]
</p>
</div>

</div>

<div id="outline-container-5" class="outline-4">
<h4 id="sec-5">JQuery</h4>
<div class="outline-text-4" id="text-5">


<p>
This section is still under construction though the accordion effects used on this page are a simple sample of JQuery usage.
</p>
</div>

</div>

<div id="outline-container-6" class="outline-4">
<h4 id="sec-6">Org-Ruby Gem</h4>
<div class="outline-text-4" id="text-6">


<p>
This section is still under construction.
</p>
</div>

</div>

<div id="outline-container-7" class="outline-4">
<h4 id="sec-7">Emacs Utilities</h4>
<div class="outline-text-4" id="text-7">


<p>
This section is still under construction.
</p>
</div>

</div>

<div id="outline-container-8" class="outline-4">
<h4 id="sec-8">My Blog</h4>
<div class="outline-text-4" id="text-8">


<p>
This section is still under construction.
</p>


</div> <!-- jquery-tab --> </div> <!-- myaccordion --> 
<script type="text/javascript">$(function() {$("#myaccordion").accordion({collapsible: true, autoHeight: false});});</script>

</div>
</div>
</div>

</body>
</html>
